#Лабораторна робота №5
#Шибецький Богдан ІС-92

#Модифікований каунтін сорт, що сортує за розрядами
def countingSort(arr, digit): 
    
    #Створюємо вихідний масив
    output = [0 for i in range(len(arr))] 
    
    #Створюємо допоміжний масив, що показує кількість кожного елементу
    count = [0 for i in range(10)] 

    #Ініціалізуємо допоміжний масив
    for i in arr: 
        #Спосіб як дістати певну цифру з числа (// - це ділення з нижнім округленням)
        count[(i // digit) % 10] += 1

    #Змінюємо цей масив, сумуючи кожен елемент з попереднім
    for i in range(1, 10): 
        count[i] += count[i-1] 

    #Процес сортування, тобто розміщення кожного з елементів за індексом каунт масиву
    for i in reversed(range(len(arr))): #reversed для правильного сортування на останній ітерації
        #Значення вхідного масиву це індекс каунт масиву, значення якого в свою чергу
        #показує куди розмістити цей елемент в вихідному масиві
        index = (arr[i] // digit) % 10
        output[count[index] - 1] = arr[i] 
        #Зменшуємо відповідне значення в масиві каунт на -1, вказуючи що за 
        #цим індексом в вихідному масиві вже існує елемент, і наступні з таким 
        #же значенням будуть перед ним.
        count[(arr[i] // digit) % 10] -= 1

    for i in range(len(arr)):
        arr[i] = output[i] 
        
def radixSort(arr): 
    '''
    k = від 0 до 9
    d = максимальна кількість цифр в числі
    n = кількість елементів
    
    алгоритм сортує до найбільшого розряду циклом while
    '''
    
    
    #Знаходимо максимальне число, щоб дізнатись найбільшу кількість цифр
    max_value = max(arr) 
  
    digit = 1 #Починаємо ці степеня 1, що означає одиниці в числі
    while max_value//digit > 0: #Сортуємо по всіх розрядах максимального числа
        countingSort(arr,digit) #Використовуємо модифікований каунтін сорт, що сортує числа за розрядами
        #Наступні ітерації проводимо для відповідно десятків, сотень і т.д.
        digit *= 10



arr = [170, 45, 75, 90, 802, 24, 2, 66]
radixSort(arr)
print(arr)
 


